MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4580/mcu.h
extern volatile CANCON_RO9bits_t CANCON_RO9bits __at(0xE2F);
// bitfield macros
#define _CANCON_RO9_FP0_POSN                                0x0
#define _CANCON_RO9_FP0_POSITION                            0x0
#define _CANCON_RO9_FP0_SIZE                                0x1
#define _CANCON_RO9_FP0_LENGTH                              0x1
#define _CANCON_RO9_FP0_MASK                                0x1
#define _CANCON_RO9_WIN0_FP1_POSN                           0x1
#define _CANCON_RO9_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO9_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO9_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO9_WIN0_FP1_MASK                           0x2
#define _CANCON_RO9_WIN1_FP2_POSN                           0x2
#define _CANCON_RO9_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO9_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO9_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO9_WIN1_FP2_MASK                           0x4
#define _CANCON_RO9_WIN2_FP3_POSN                           0x3
#define _CANCON_RO9_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO9_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO9_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO9_WIN2_FP3_MASK                           0x8
#define _CANCON_RO9_ABAT_POSN                               0x4
#define _CANCON_RO9_ABAT_POSITION                           0x4
#define _CANCON_RO9_ABAT_SIZE                               0x1
#define _CANCON_RO9_ABAT_LENGTH                             0x1
#define _CANCON_RO9_ABAT_MASK                               0x10
#define _CANCON_RO9_REQOP0_POSN                             0x5
#define _CANCON_RO9_REQOP0_POSITION                         0x5
#define _CANCON_RO9_REQOP0_SIZE                             0x1
#define _CANCON_RO9_REQOP0_LENGTH                           0x1
#define _CANCON_RO9_REQOP0_MASK                             0x20
#define _CANCON_RO9_REQOP1_POSN                             0x6
#define _CANCON_RO9_REQOP1_POSITION                         0x6
#define _CANCON_RO9_REQOP1_SIZE                             0x1
#define _CANCON_RO9_REQOP1_LENGTH                           0x1
#define _CANCON_RO9_REQOP1_MASK                             0x40
#define _CANCON_RO9_REQOP2_POSN                             0x7
#define _CANCON_RO9_REQOP2_POSITION                         0x7
#define _CANCON_RO9_REQOP2_SIZE                             0x1
#define _CANCON_RO9_REQOP2_LENGTH                           0x1
#define _CANCON_RO9_REQOP2_MASK                             0x80
#define _CANCON_RO9_WIN0_POSN                               0x1
#define _CANCON_RO9_WIN0_POSITION                           0x1
#define _CANCON_RO9_WIN0_SIZE                               0x1
#define _CANCON_RO9_WIN0_LENGTH                             0x1
#define _CANCON_RO9_WIN0_MASK                               0x2
#define _CANCON_RO9_WIN1_POSN                               0x2
#define _CANCON_RO9_WIN1_POSITION                           0x2
#define _CANCON_RO9_WIN1_SIZE                               0x1
#define _CANCON_RO9_WIN1_LENGTH                             0x1
#define _CANCON_RO9_WIN1_MASK                               0x4
#define _CANCON_RO9_WIN2_POSN                               0x3
#define _CANCON_RO9_WIN2_POSITION                           0x3
#define _CANCON_RO9_WIN2_SIZE                               0x1
#define _CANCON_RO9_WIN2_LENGTH                             0x1
#define _CANCON_RO9_WIN2_MASK                               0x8

// Register: B1CON
#define B1CON B1CON
extern volatile unsigned char           B1CON               __at(0xE30);
#ifndef _LIB_BUILD
asm("B1CON equ 0E30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FILHIT0_TXPRI0         :1;
        unsigned FILHIT1_TXPRI1         :1;
        unsigned FILHIT2_RTREN          :1;
        unsigned FILHIT3_TXREQ          :1;
        unsigned FILHIT4_TXERR          :1;
        unsigned RXRTRRO_TXLARB         :1;
        unsigned RXM1_TXABT             :1;
        unsigned RXFUL_TXBIF            :1;
    };
    struct {
        unsigned FILHIT0                :1;
        unsigned FILHIT1                :1;
        unsigned FILHIT2                :1;
        unsigned FILHIT3                :1;
        unsigned FILHIT4                :1;
        unsigned RTRRO                  :1;
        unsigned RXM1                   :1;
        unsigned RXFUL                  :1;
    };
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
        unsigned RTREN                  :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
        unsigned TXBIF                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned RXRTRRO                :1;
    };
    struct {
        unsigned B1FILHIT0              :1;
        unsigned B1FILHIT1              :1;
        unsigned B1FILHIT2              :1;
        unsigned B1FILHIT3              :1;
        unsigned B1FILHIT4              :1;
        unsigned B1RTRRO                :1;
        unsigned B1RXM1                 :1;
        unsigned B1RXFUL                :1;
    };
    struct {
        unsigned B1TXPRI0               :1;
        unsigned B1TXPRI1               :1;
        unsigned B1RTREN                :1;
        unsigned B1TXREQ                :1;
        unsigned B1TXERR                :1;
        unsigned B1TXLARB               :1;
        unsigned B1TXABT                :1;
        unsigned B1TXB3IF               :1;
    };
} B1CONbits_t;
extern volatile B1CONbits_t B1CONbits __at(0xE30);
// bitfield macros
#define _B1CON_FILHIT0_TXPRI0_POSN                          0x0
#define _B1CON_FILHIT0_TXPRI0_POSITION                      0x0
#define _B1CON_FILHIT0_TXPRI0_SIZE                          0x1
#define _B1CON_FILHIT0_TXPRI0_LENGTH                        0x1
#define _B1CON_FILHIT0_TXPRI0_MASK                          0x1
#define _B1CON_FILHIT1_TXPRI1_POSN                          0x1
#define _B1CON_FILHIT1_TXPRI1_POSITION                      0x1
#define _B1CON_FILHIT1_TXPRI1_SIZE                          0x1
#define _B1CON_FILHIT1_TXPRI1_LENGTH                        0x1
#define _B1CON_FILHIT1_TXPRI1_MASK                          0x2
#define _B1CON_FILHIT2_RTREN_POSN                           0x2
#define _B1CON_FILHIT2_RTREN_POSITION                       0x2
#define _B1CON_FILHIT2_RTREN_SIZE                           0x1
#define _B1CON_FILHIT2_RTREN_LENGTH                         0x1
#define _B1CON_FILHIT2_RTREN_MASK                           0x4
#define _B1CON_FILHIT3_TXREQ_POSN                           0x3
#define _B1CON_FILHIT3_TXREQ_POSITION                       0x3
#define _B1CON_FILHIT3_TXREQ_SIZE                           0x1
#define _B1CON_FILHIT3_TXREQ_LENGTH                         0x1
#define _B1CON_FILHIT3_TXREQ_MASK                           0x8
#define _B1CON_FILHIT4_TXERR_POSN                           0x4
#define _B1CON_FILHIT4_TXERR_POSITION                       0x4
#define _B1CON_FILHIT4_TXERR_SIZE                           0x1
#define _B1CON_FILHIT4_TXERR_LENGTH                         0x1
#define _B1CON_FILHIT4_TXERR_MASK                           0x10
#define _B1CON_RXRTRRO_TXLARB_POSN                          0x5
#define _B1CON_RXRTRRO_TXLARB_POSITION                      0x5
#define _B1CON_RXRTRRO_TXLARB_SIZE                          0x1
#define _B1CON_RXRTRRO_TXLARB_LENGTH                        0x1
#define _B1CON_RXRTRRO_TXLARB_MASK                          0x20
#define _B1CON_RXM1_TXABT_POSN                              0x6
#define _B1CON_RXM1_TXABT_POSITION                          0x6
#define _B1CON_RXM1_TXABT_SIZE                              0x1
#define _B1CON_RXM1_TXABT_LENGTH                            0x1
#define _B1CON_RXM1_TXABT_MASK                              0x40
#define _B1CON_RXFUL_TXBIF_POSN                             0x7
#define _B1CON_RXFUL_TXBIF_POSITION                         0x7
#define _B1CON_RXFUL_TXBIF_SIZE                             0x1
#define _B1CON_RXFUL_TXBIF_LENGTH                           0x1
#define _B1CON_RXFUL_TXBIF_MASK                             0x80
#define _B1CON_FILHIT0_POSN                                 0x0
#define _B1CON_FILHIT0_POSITION                             0x0
#define _B1CON_FILHIT0_SIZE                                 0x1
#define _B1CON_FILHIT0_LENGTH                               0x1
#define _B1CON_FILHIT0_MASK                                 0x1
#define _B1CON_FILHIT1_POSN                                 0x1
#define _B1CON_FILHIT1_POSITION                             0x1
#define _B1CON_FILHIT1_SIZE                                 0x1
#define _B1CON_FILHIT1_LENGTH                               0x1
#define _B1CON_FILHIT1_MASK                                 0x2
#define _B1CON_FILHIT2_POSN                                 0x2
#define _B1CON_FILHIT2_POSITION                             0x2
#define _B1CON_FILHIT2_SIZE                                 0x1
#define _B1CON_FILHIT2_LENGTH                               0x1
#define _B1CON_FILHIT2_MASK                                 0x4
#define _B1CON_FILHIT3_POSN                                 0x3
#define _B1CON_FILHIT3_POSITION                             0x3
#define _B1CON_FILHIT3_SIZE                                 0x1
#define _B1CON_FILHIT3_LENGTH                               0x1
#define _B1CON_FILHIT3_MASK                                 0x8
#define _B1CON_FILHIT4_POSN                                 0x4
#define _B1CON_FILHIT4_POSITION                             0x4
#define _B1CON_FILHIT4_SIZE                                 0x1
#define _B1CON_FILHIT4_LENGTH                               0x1
#define _B1CON_FILHIT4_MASK                                 0x10
#define _B1CON_RTRRO_POSN                                   0x5
#define _B1CON_RTRRO_POSITION                               0x5
#define _B1CON_RTRRO_SIZE                                   0x1
#define _B1CON_RTRRO_LENGTH                                 0x1
#define _B1CON_RTRRO_MASK                                   0x20
#define _B1CON_RXM1_POSN                                    0x6
#define _B1CON_RXM1_POSITION                                0x6
#define _B1CON_RXM1_SIZE                                    0x1
#define _B1CON_RXM1_LENGTH                                  0x1
#define _B1CON_RXM1_MASK                                    0x40
#define _B1CON_RXFUL_POSN                                   0x7
#define _B1CON_RXFUL_POSITION                               0x7
#define _B1CON_RXFUL_SIZE                                   0x1
#define _B1CON_RXFUL_LENGTH                                 0x1
#define _B1CON_RXFUL_MASK                                   0x80
#define _B1CON_TXPRI0_POSN                                  0x0
#define _B1CON_TXPRI0_POSITION                              0x0
#define _B1CON_TXPRI0_SIZE                                  0x1
#define _B1CON_TXPRI0_LENGTH                                0x1
#define _B1CON_TXPRI0_MASK                                  0x1
#define _B1CON_TXPRI1_POSN                                  0x1
#define _B1CON_TXPRI1_POSITION                              0x1
#define _B1CON_TXPRI1_SIZE                                  0x1
#define _B1CON_TXPRI1_LENGTH                                0x1
#define _B1CON_TXPRI1_MASK                                  0x2
#define _B1CON_RTREN_POSN                                   0x2
#define _B1CON_RTREN_POSITION                               0x2
#define _B1CON_RTREN_SIZE                                   0x1
#define _B1CON_RTREN_LENGTH                                 0x1
#define _B1CON_RTREN_MASK                                   0x4
#define _B1CON_TXREQ_POSN                                   0x3
#define _B1CON_TXREQ_POSITION                               0x3
#define _B1CON_TXREQ_SIZE                                   0x1
#define _B1CON_TXREQ_LENGTH                                 0x1
#define _B1CON_TXREQ_MASK                                   0x8
#define _B1CON_TXERR_POSN                                   0x4
#define _B1CON_TXERR_POSITION                               0x4
#define _B1CON_TXERR_SIZE                                   0x1
#define _B1CON_TXERR_LENGTH                                 0x1
#define _B1CON_TXERR_MASK                                   0x10
#define _B1CON_TXLARB_POSN                                  0x5
#define _B1CON_TXLARB_POSITION                              0x5
#define _B1CON_TXLARB_SIZE                                  0x1
#define _B1CON_TXLARB_LENGTH                                0x1
#define _B1CON_TXLARB_MASK                                  0x20
#define _B1CON_TXABT_POSN                                   0x6
#define _B1CON_TXABT_POSITION                               0x6
#define _B1CON_TXABT_SIZE                                   0x1
#define _B1CON_TXABT_LENGTH                                 0x1
#define _B1CON_TXABT_MASK                                   0x40
#define _B1CON_TXBIF_POSN                                   0x7
#define _B1CON_TXBIF_POSITION                               0x7
#define _B1CON_TXBIF_SIZE                                   0x1
#define _B1CON_TXBIF_LENGTH                                 0x1
#define _B1CON_TXBIF_MASK                                   0x80
#define _B1CON_RXRTRRO_POSN                                 0x5
#define _B1CON_RXRTRRO_POSITION                             0x5
#define _B1CON_RXRTRRO_SIZE                                 0x1
#define _B1CON_RXRTRRO_LENGTH                               0x1
#define _B1CON_RXRTRRO_MASK                                 0x20
#define _B1CON_B1FILHIT0_POSN                               0x0
#define _B1CON_B1FILHIT0_POSITION                           0x0
#define _B1CON_B1FILHIT0_SIZE                               0x1
#define _B1CON_B1FILHIT0_LENGTH                             0x1
#define _B1CON_B1FILHIT0_MASK                               0x1
#define _B1CON_B1FILHIT1_POSN                               0x1
#define _B1CON_B1FILHIT1_POSITION                           0x1
#define _B1CON_B1FILHIT1_SIZE                               0x1
#define _B1CON_B1FILHIT1_LENGTH                             0x1
#define _B1CON_B1FILHIT1_MASK                               0x2
#define _B1CON_B1FILHIT2_POSN                               0x2
#define _B1CON_B1FILHIT2_POSITION                           0x2
#define _B1CON_B1FILHIT2_SIZE                               0x1
#define _B1CON_B1FILHIT2_LENGTH                             0x1
#define _B1CON_B1FILHIT2_MASK                               0x4
#define _B1CON_B1FILHIT3_POSN                               0x3
#define _B1CON_B1FILHIT3_POSITION                           0x3
#define _B1CON_B1FILHIT3_SIZE                               0x1
#define _B1CON_B1FILHIT3_LENGTH                             0x1
#define _B1CON_B1FILHIT3_MASK                               0x8
#define _B1CON_B1FILHIT4_POSN                               0x4
#define _B1CON_B1FILHIT4_POSITION                           0x4
#define _B1CON_B1FILHIT4_SIZE                               0x1
#define _B1CON_B1FILHIT4_LENGTH                             0x1
#define _B1CON_B1FILHIT4_MASK                               0x10
#define _B1CON_B1RTRRO_POSN                                 0x5
#define _B1CON_B1RTRRO_POSITION                             0x5
#define _B1CON_B1RTRRO_SIZE                                 0x1
#define _B1CON_B1RTRRO_LENGTH                               0x1
#define _B1CON_B1RTRRO_MASK                                 0x20
#define _B1CON_B1RXM1_POSN                                  0x6
#define _B1CON_B1RXM1_POSITION                              0x6
#define _B1CON_B1RXM1_SIZE                                  0x1
#define _B1CON_B1RXM1_LENGTH                                0x1
#define _B1CON_B1RXM1_MASK                                  0x40
#define _B1CON_B1RXFUL_POSN                                 0x7
#define _B1CON_B1RXFUL_POSITION                             0x7
#define _B1CON_B1RXFUL_SIZE                                 0x1
#define _B1CON_B1RXFUL_LENGTH                               0x1
#define _B1CON_B1RXFUL_MASK                                 0x80
#define _B1CON_B1TXPRI0_POSN                                0x0
#define _B1CON_B1TXPRI0_POSITION                            0x0
#define _B1CON_B1TXPRI0_SIZE                                0x1
#define _B1CON_B1TXPRI0_LENGTH                              0x1
#define _B1CON_B1TXPRI0_MASK                                0x1
#define _B1CON_B1TXPRI1_POSN                                0x1
#define _B1CON_B1TXPRI1_POSITION                            0x1
#define _B1CON_B1TXPRI1_SIZE                                0x1
#define _B1CON_B1TXPRI1_LENGTH                              0x1
#define _B1CON_B1TXPRI1_MASK                                0x2
#define _B1CON_B1RTREN_POSN                                 0x2
#define _B1CON_B1RTREN_POSITION                             0x2
#define _B1CON_B1RTREN_SIZE                                 0x1
#define _B1CON_B1RTREN_LENGTH                               0x1
#define _B1CON_B1RTREN_MASK                                 0x4
#define _B1CON_B1TXREQ_POSN                                 0x3
#define _B1CON_B1TXREQ_POSITION                             0x3
#define _B1CON_B1TXREQ_SIZE                                 0x1
#define _B1CON_B1TXREQ_LENGTH                               0x1
#define _B1CON_B1TXREQ_MASK                                 0x8
#define _B1CON_B1TXERR_POSN                                 0x4
#define _B1CON_B1TXERR_POSITION                             0x4
#define _B1CON_B1TXERR_SIZE                                 0x1
#define _B1CON_B1TXERR_LENGTH                               0x1
#define _B1CON_B1TXERR_MASK                                 0x10
#define _B1CON_B1TXLARB_POSN                                0x5
#define _B1CON_B1TXLARB_POSITION                            0x5
#define _B1CON_B1TXLARB_SIZE                                0x1
#define _B1CON_B1TXLARB_LENGTH                              0x1
#define _B1CON_B1TXLARB_MASK                                0x20
#define _B1CON_B1TXABT_POSN                                 0x6
#define _B1CON_B1TXABT_POSITION                             0x6
#define _B1CON_B1TXABT_SIZE                                 0x1
#define _B1CON_B1TXABT_LENGTH                               0x1
#define _B1CON_B1TXABT_MASK                                 0x40
#define _B1CON_B1TXB3IF_POSN                                0x7
#define _B1CON_B1TXB3IF_POSITION                            0x7
#define _B1CON_B1TXB3IF_SIZE                                0x1
#define _B1CON_B1TXB3IF_LENGTH                              0x1
#define _B1CON_B1TXB3IF_MASK                                0x80

// Register: B1SIDH
#define B1SIDH B1SIDH
extern volatile unsigned char           B1SIDH              __at(0xE31);
#ifndef _LIB_BUILD
asm("B1SIDH equ 0E31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned B1SID3                 :1;
        unsigned B1SID4                 :1;
        unsigned B1SID5                 :1;
        unsigned B1SID6                 :1;
        unsigned B1SID7                 :1;
        unsigned B1SID8                 :1;
        unsigned B1SID9                 :1;
        unsigned B1SID10                :1;
    };
} B1SIDHbits_t;
