MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4580/mcu.h
extern volatile B2D3bits_t B2D3bits __at(0xE49);
// bitfield macros
#define _B2D3_B2D30_POSN                                    0x0
#define _B2D3_B2D30_POSITION                                0x0
#define _B2D3_B2D30_SIZE                                    0x1
#define _B2D3_B2D30_LENGTH                                  0x1
#define _B2D3_B2D30_MASK                                    0x1
#define _B2D3_B2D31_POSN                                    0x1
#define _B2D3_B2D31_POSITION                                0x1
#define _B2D3_B2D31_SIZE                                    0x1
#define _B2D3_B2D31_LENGTH                                  0x1
#define _B2D3_B2D31_MASK                                    0x2
#define _B2D3_B2D32_POSN                                    0x2
#define _B2D3_B2D32_POSITION                                0x2
#define _B2D3_B2D32_SIZE                                    0x1
#define _B2D3_B2D32_LENGTH                                  0x1
#define _B2D3_B2D32_MASK                                    0x4
#define _B2D3_B2D33_POSN                                    0x3
#define _B2D3_B2D33_POSITION                                0x3
#define _B2D3_B2D33_SIZE                                    0x1
#define _B2D3_B2D33_LENGTH                                  0x1
#define _B2D3_B2D33_MASK                                    0x8
#define _B2D3_B2D34_POSN                                    0x4
#define _B2D3_B2D34_POSITION                                0x4
#define _B2D3_B2D34_SIZE                                    0x1
#define _B2D3_B2D34_LENGTH                                  0x1
#define _B2D3_B2D34_MASK                                    0x10
#define _B2D3_B2D35_POSN                                    0x5
#define _B2D3_B2D35_POSITION                                0x5
#define _B2D3_B2D35_SIZE                                    0x1
#define _B2D3_B2D35_LENGTH                                  0x1
#define _B2D3_B2D35_MASK                                    0x20
#define _B2D3_B2D36_POSN                                    0x6
#define _B2D3_B2D36_POSITION                                0x6
#define _B2D3_B2D36_SIZE                                    0x1
#define _B2D3_B2D36_LENGTH                                  0x1
#define _B2D3_B2D36_MASK                                    0x40
#define _B2D3_B2D37_POSN                                    0x7
#define _B2D3_B2D37_POSITION                                0x7
#define _B2D3_B2D37_SIZE                                    0x1
#define _B2D3_B2D37_LENGTH                                  0x1
#define _B2D3_B2D37_MASK                                    0x80

// Register: B2D4
#define B2D4 B2D4
extern volatile unsigned char           B2D4                __at(0xE4A);
#ifndef _LIB_BUILD
asm("B2D4 equ 0E4Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D40                  :1;
        unsigned B2D41                  :1;
        unsigned B2D42                  :1;
        unsigned B2D43                  :1;
        unsigned B2D44                  :1;
        unsigned B2D45                  :1;
        unsigned B2D46                  :1;
        unsigned B2D47                  :1;
    };
} B2D4bits_t;
extern volatile B2D4bits_t B2D4bits __at(0xE4A);
// bitfield macros
#define _B2D4_B2D40_POSN                                    0x0
#define _B2D4_B2D40_POSITION                                0x0
#define _B2D4_B2D40_SIZE                                    0x1
#define _B2D4_B2D40_LENGTH                                  0x1
#define _B2D4_B2D40_MASK                                    0x1
#define _B2D4_B2D41_POSN                                    0x1
#define _B2D4_B2D41_POSITION                                0x1
#define _B2D4_B2D41_SIZE                                    0x1
#define _B2D4_B2D41_LENGTH                                  0x1
#define _B2D4_B2D41_MASK                                    0x2
#define _B2D4_B2D42_POSN                                    0x2
#define _B2D4_B2D42_POSITION                                0x2
#define _B2D4_B2D42_SIZE                                    0x1
#define _B2D4_B2D42_LENGTH                                  0x1
#define _B2D4_B2D42_MASK                                    0x4
#define _B2D4_B2D43_POSN                                    0x3
#define _B2D4_B2D43_POSITION                                0x3
#define _B2D4_B2D43_SIZE                                    0x1
#define _B2D4_B2D43_LENGTH                                  0x1
#define _B2D4_B2D43_MASK                                    0x8
#define _B2D4_B2D44_POSN                                    0x4
#define _B2D4_B2D44_POSITION                                0x4
#define _B2D4_B2D44_SIZE                                    0x1
#define _B2D4_B2D44_LENGTH                                  0x1
#define _B2D4_B2D44_MASK                                    0x10
#define _B2D4_B2D45_POSN                                    0x5
#define _B2D4_B2D45_POSITION                                0x5
#define _B2D4_B2D45_SIZE                                    0x1
#define _B2D4_B2D45_LENGTH                                  0x1
#define _B2D4_B2D45_MASK                                    0x20
#define _B2D4_B2D46_POSN                                    0x6
#define _B2D4_B2D46_POSITION                                0x6
#define _B2D4_B2D46_SIZE                                    0x1
#define _B2D4_B2D46_LENGTH                                  0x1
#define _B2D4_B2D46_MASK                                    0x40
#define _B2D4_B2D47_POSN                                    0x7
#define _B2D4_B2D47_POSITION                                0x7
#define _B2D4_B2D47_SIZE                                    0x1
#define _B2D4_B2D47_LENGTH                                  0x1
#define _B2D4_B2D47_MASK                                    0x80

// Register: B2D5
#define B2D5 B2D5
extern volatile unsigned char           B2D5                __at(0xE4B);
#ifndef _LIB_BUILD
asm("B2D5 equ 0E4Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D50                  :1;
        unsigned B2D51                  :1;
        unsigned B2D52                  :1;
        unsigned B2D53                  :1;
        unsigned B2D54                  :1;
        unsigned B2D55                  :1;
        unsigned B2D56                  :1;
        unsigned B2D57                  :1;
    };
} B2D5bits_t;
extern volatile B2D5bits_t B2D5bits __at(0xE4B);
// bitfield macros
#define _B2D5_B2D50_POSN                                    0x0
#define _B2D5_B2D50_POSITION                                0x0
#define _B2D5_B2D50_SIZE                                    0x1
#define _B2D5_B2D50_LENGTH                                  0x1
#define _B2D5_B2D50_MASK                                    0x1
#define _B2D5_B2D51_POSN                                    0x1
#define _B2D5_B2D51_POSITION                                0x1
#define _B2D5_B2D51_SIZE                                    0x1
#define _B2D5_B2D51_LENGTH                                  0x1
#define _B2D5_B2D51_MASK                                    0x2
#define _B2D5_B2D52_POSN                                    0x2
#define _B2D5_B2D52_POSITION                                0x2
#define _B2D5_B2D52_SIZE                                    0x1
#define _B2D5_B2D52_LENGTH                                  0x1
#define _B2D5_B2D52_MASK                                    0x4
#define _B2D5_B2D53_POSN                                    0x3
#define _B2D5_B2D53_POSITION                                0x3
#define _B2D5_B2D53_SIZE                                    0x1
#define _B2D5_B2D53_LENGTH                                  0x1
#define _B2D5_B2D53_MASK                                    0x8
#define _B2D5_B2D54_POSN                                    0x4
#define _B2D5_B2D54_POSITION                                0x4
#define _B2D5_B2D54_SIZE                                    0x1
#define _B2D5_B2D54_LENGTH                                  0x1
#define _B2D5_B2D54_MASK                                    0x10
#define _B2D5_B2D55_POSN                                    0x5
#define _B2D5_B2D55_POSITION                                0x5
#define _B2D5_B2D55_SIZE                                    0x1
#define _B2D5_B2D55_LENGTH                                  0x1
#define _B2D5_B2D55_MASK                                    0x20
#define _B2D5_B2D56_POSN                                    0x6
#define _B2D5_B2D56_POSITION                                0x6
#define _B2D5_B2D56_SIZE                                    0x1
#define _B2D5_B2D56_LENGTH                                  0x1
#define _B2D5_B2D56_MASK                                    0x40
#define _B2D5_B2D57_POSN                                    0x7
#define _B2D5_B2D57_POSITION                                0x7
#define _B2D5_B2D57_SIZE                                    0x1
#define _B2D5_B2D57_LENGTH                                  0x1
#define _B2D5_B2D57_MASK                                    0x80

