MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4580/mcu.h
#define                                 RXF7EXIDEN_bit      _BIT_ACCESS(RXF7SIDL,3)
// RXF7SIDL<RXF7SID0>
extern volatile __bit                   RXF7SID0            __at(0x6B2D);	// @ (0xD65 * 8 + 5)
#define                                 RXF7SID0_bit        _BIT_ACCESS(RXF7SIDL,5)
// RXF7SIDL<RXF7SID1>
extern volatile __bit                   RXF7SID1            __at(0x6B2E);	// @ (0xD65 * 8 + 6)
#define                                 RXF7SID1_bit        _BIT_ACCESS(RXF7SIDL,6)
// RXF7SIDH<RXF7SID10>
extern volatile __bit                   RXF7SID10           __at(0x6B27);	// @ (0xD64 * 8 + 7)
#define                                 RXF7SID10_bit       _BIT_ACCESS(RXF7SIDH,7)
// RXF7SIDL<RXF7SID2>
extern volatile __bit                   RXF7SID2            __at(0x6B2F);	// @ (0xD65 * 8 + 7)
#define                                 RXF7SID2_bit        _BIT_ACCESS(RXF7SIDL,7)
// RXF7SIDH<RXF7SID3>
extern volatile __bit                   RXF7SID3            __at(0x6B20);	// @ (0xD64 * 8 + 0)
#define                                 RXF7SID3_bit        _BIT_ACCESS(RXF7SIDH,0)
// RXF7SIDH<RXF7SID4>
extern volatile __bit                   RXF7SID4            __at(0x6B21);	// @ (0xD64 * 8 + 1)
#define                                 RXF7SID4_bit        _BIT_ACCESS(RXF7SIDH,1)
// RXF7SIDH<RXF7SID5>
extern volatile __bit                   RXF7SID5            __at(0x6B22);	// @ (0xD64 * 8 + 2)
#define                                 RXF7SID5_bit        _BIT_ACCESS(RXF7SIDH,2)
// RXF7SIDH<RXF7SID6>
extern volatile __bit                   RXF7SID6            __at(0x6B23);	// @ (0xD64 * 8 + 3)
#define                                 RXF7SID6_bit        _BIT_ACCESS(RXF7SIDH,3)
// RXF7SIDH<RXF7SID7>
extern volatile __bit                   RXF7SID7            __at(0x6B24);	// @ (0xD64 * 8 + 4)
#define                                 RXF7SID7_bit        _BIT_ACCESS(RXF7SIDH,4)
// RXF7SIDH<RXF7SID8>
extern volatile __bit                   RXF7SID8            __at(0x6B25);	// @ (0xD64 * 8 + 5)
#define                                 RXF7SID8_bit        _BIT_ACCESS(RXF7SIDH,5)
// RXF7SIDH<RXF7SID9>
extern volatile __bit                   RXF7SID9            __at(0x6B26);	// @ (0xD64 * 8 + 6)
#define                                 RXF7SID9_bit        _BIT_ACCESS(RXF7SIDH,6)
// RXF8EIDL<RXF8EID0>
extern volatile __bit                   RXF8EID0            __at(0x6B58);	// @ (0xD6B * 8 + 0)
#define                                 RXF8EID0_bit        _BIT_ACCESS(RXF8EIDL,0)
// RXF8EIDL<RXF8EID1>
extern volatile __bit                   RXF8EID1            __at(0x6B59);	// @ (0xD6B * 8 + 1)
#define                                 RXF8EID1_bit        _BIT_ACCESS(RXF8EIDL,1)
// RXF8EIDH<RXF8EID10>
extern volatile __bit                   RXF8EID10           __at(0x6B52);	// @ (0xD6A * 8 + 2)
#define                                 RXF8EID10_bit       _BIT_ACCESS(RXF8EIDH,2)
// RXF8EIDH<RXF8EID11>
extern volatile __bit                   RXF8EID11           __at(0x6B53);	// @ (0xD6A * 8 + 3)
#define                                 RXF8EID11_bit       _BIT_ACCESS(RXF8EIDH,3)
// RXF8EIDH<RXF8EID12>
extern volatile __bit                   RXF8EID12           __at(0x6B54);	// @ (0xD6A * 8 + 4)
#define                                 RXF8EID12_bit       _BIT_ACCESS(RXF8EIDH,4)
// RXF8EIDH<RXF8EID13>
extern volatile __bit                   RXF8EID13           __at(0x6B55);	// @ (0xD6A * 8 + 5)
#define                                 RXF8EID13_bit       _BIT_ACCESS(RXF8EIDH,5)
// RXF8EIDH<RXF8EID14>
extern volatile __bit                   RXF8EID14           __at(0x6B56);	// @ (0xD6A * 8 + 6)
#define                                 RXF8EID14_bit       _BIT_ACCESS(RXF8EIDH,6)
// RXF8EIDH<RXF8EID15>
extern volatile __bit                   RXF8EID15           __at(0x6B57);	// @ (0xD6A * 8 + 7)
#define                                 RXF8EID15_bit       _BIT_ACCESS(RXF8EIDH,7)
// RXF8SIDL<RXF8EID16>
extern volatile __bit                   RXF8EID16           __at(0x6B48);	// @ (0xD69 * 8 + 0)
#define                                 RXF8EID16_bit       _BIT_ACCESS(RXF8SIDL,0)
// RXF8SIDL<RXF8EID17>
extern volatile __bit                   RXF8EID17           __at(0x6B49);	// @ (0xD69 * 8 + 1)
#define                                 RXF8EID17_bit       _BIT_ACCESS(RXF8SIDL,1)
// RXF8EIDL<RXF8EID2>
extern volatile __bit                   RXF8EID2            __at(0x6B5A);	// @ (0xD6B * 8 + 2)
#define                                 RXF8EID2_bit        _BIT_ACCESS(RXF8EIDL,2)
// RXF8EIDL<RXF8EID3>
extern volatile __bit                   RXF8EID3            __at(0x6B5B);	// @ (0xD6B * 8 + 3)
#define                                 RXF8EID3_bit        _BIT_ACCESS(RXF8EIDL,3)
// RXF8EIDL<RXF8EID4>
extern volatile __bit                   RXF8EID4            __at(0x6B5C);	// @ (0xD6B * 8 + 4)
#define                                 RXF8EID4_bit        _BIT_ACCESS(RXF8EIDL,4)
// RXF8EIDL<RXF8EID5>
extern volatile __bit                   RXF8EID5            __at(0x6B5D);	// @ (0xD6B * 8 + 5)
#define                                 RXF8EID5_bit        _BIT_ACCESS(RXF8EIDL,5)
// RXF8EIDL<RXF8EID6>
extern volatile __bit                   RXF8EID6            __at(0x6B5E);	// @ (0xD6B * 8 + 6)
#define                                 RXF8EID6_bit        _BIT_ACCESS(RXF8EIDL,6)
// RXF8EIDL<RXF8EID7>
extern volatile __bit                   RXF8EID7            __at(0x6B5F);	// @ (0xD6B * 8 + 7)
#define                                 RXF8EID7_bit        _BIT_ACCESS(RXF8EIDL,7)
// RXF8EIDH<RXF8EID8>
extern volatile __bit                   RXF8EID8            __at(0x6B50);	// @ (0xD6A * 8 + 0)
#define                                 RXF8EID8_bit        _BIT_ACCESS(RXF8EIDH,0)
// RXF8EIDH<RXF8EID9>
extern volatile __bit                   RXF8EID9            __at(0x6B51);	// @ (0xD6A * 8 + 1)
#define                                 RXF8EID9_bit        _BIT_ACCESS(RXF8EIDH,1)
// RXFCON1<RXF8EN>
extern volatile __bit                   RXF8EN              __at(0x6EA8);	// @ (0xDD5 * 8 + 0)
#define                                 RXF8EN_bit          _BIT_ACCESS(RXFCON1,0)
// RXF8SIDL<RXF8EXIDEN>
extern volatile __bit                   RXF8EXIDEN          __at(0x6B4B);	// @ (0xD69 * 8 + 3)
#define                                 RXF8EXIDEN_bit      _BIT_ACCESS(RXF8SIDL,3)
// RXF8SIDL<RXF8SID0>
extern volatile __bit                   RXF8SID0            __at(0x6B4D);	// @ (0xD69 * 8 + 5)
#define                                 RXF8SID0_bit        _BIT_ACCESS(RXF8SIDL,5)
// RXF8SIDL<RXF8SID1>
extern volatile __bit                   RXF8SID1            __at(0x6B4E);	// @ (0xD69 * 8 + 6)
#define                                 RXF8SID1_bit        _BIT_ACCESS(RXF8SIDL,6)
// RXF8SIDH<RXF8SID10>
extern volatile __bit                   RXF8SID10           __at(0x6B47);	// @ (0xD68 * 8 + 7)
#define                                 RXF8SID10_bit       _BIT_ACCESS(RXF8SIDH,7)
// RXF8SIDL<RXF8SID2>
extern volatile __bit                   RXF8SID2            __at(0x6B4F);	// @ (0xD69 * 8 + 7)
#define                                 RXF8SID2_bit        _BIT_ACCESS(RXF8SIDL,7)
// RXF8SIDH<RXF8SID3>
extern volatile __bit                   RXF8SID3            __at(0x6B40);	// @ (0xD68 * 8 + 0)
#define                                 RXF8SID3_bit        _BIT_ACCESS(RXF8SIDH,0)
// RXF8SIDH<RXF8SID4>
extern volatile __bit                   RXF8SID4            __at(0x6B41);	// @ (0xD68 * 8 + 1)
#define                                 RXF8SID4_bit        _BIT_ACCESS(RXF8SIDH,1)
// RXF8SIDH<RXF8SID5>
extern volatile __bit                   RXF8SID5            __at(0x6B42);	// @ (0xD68 * 8 + 2)
#define                                 RXF8SID5_bit        _BIT_ACCESS(RXF8SIDH,2)
// RXF8SIDH<RXF8SID6>
extern volatile __bit                   RXF8SID6            __at(0x6B43);	// @ (0xD68 * 8 + 3)
#define                                 RXF8SID6_bit        _BIT_ACCESS(RXF8SIDH,3)
// RXF8SIDH<RXF8SID7>
extern volatile __bit                   RXF8SID7            __at(0x6B44);	// @ (0xD68 * 8 + 4)
#define                                 RXF8SID7_bit        _BIT_ACCESS(RXF8SIDH,4)
// RXF8SIDH<RXF8SID8>
extern volatile __bit                   RXF8SID8            __at(0x6B45);	// @ (0xD68 * 8 + 5)
#define                                 RXF8SID8_bit        _BIT_ACCESS(RXF8SIDH,5)
// RXF8SIDH<RXF8SID9>
extern volatile __bit                   RXF8SID9            __at(0x6B46);	// @ (0xD68 * 8 + 6)
#define                                 RXF8SID9_bit        _BIT_ACCESS(RXF8SIDH,6)
// RXF9EIDL<RXF9EID0>
extern volatile __bit                   RXF9EID0            __at(0x6B98);	// @ (0xD73 * 8 + 0)
#define                                 RXF9EID0_bit        _BIT_ACCESS(RXF9EIDL,0)
// RXF9EIDL<RXF9EID1>
extern volatile __bit                   RXF9EID1            __at(0x6B99);	// @ (0xD73 * 8 + 1)
#define                                 RXF9EID1_bit        _BIT_ACCESS(RXF9EIDL,1)
// RXF9EIDH<RXF9EID10>
extern volatile __bit                   RXF9EID10           __at(0x6B92);	// @ (0xD72 * 8 + 2)
#define                                 RXF9EID10_bit       _BIT_ACCESS(RXF9EIDH,2)
// RXF9EIDH<RXF9EID11>
extern volatile __bit                   RXF9EID11           __at(0x6B93);	// @ (0xD72 * 8 + 3)
#define                                 RXF9EID11_bit       _BIT_ACCESS(RXF9EIDH,3)
// RXF9EIDH<RXF9EID12>
extern volatile __bit                   RXF9EID12           __at(0x6B94);	// @ (0xD72 * 8 + 4)
#define                                 RXF9EID12_bit       _BIT_ACCESS(RXF9EIDH,4)
// RXF9EIDH<RXF9EID13>
extern volatile __bit                   RXF9EID13           __at(0x6B95);	// @ (0xD72 * 8 + 5)
#define                                 RXF9EID13_bit       _BIT_ACCESS(RXF9EIDH,5)
// RXF9EIDH<RXF9EID14>
extern volatile __bit                   RXF9EID14           __at(0x6B96);	// @ (0xD72 * 8 + 6)
#define                                 RXF9EID14_bit       _BIT_ACCESS(RXF9EIDH,6)
// RXF9EIDH<RXF9EID15>
extern volatile __bit                   RXF9EID15           __at(0x6B97);	// @ (0xD72 * 8 + 7)
#define                                 RXF9EID15_bit       _BIT_ACCESS(RXF9EIDH,7)
// RXF9SIDL<RXF9EID16>
extern volatile __bit                   RXF9EID16           __at(0x6B88);	// @ (0xD71 * 8 + 0)
#define                                 RXF9EID16_bit       _BIT_ACCESS(RXF9SIDL,0)
// RXF9SIDL<RXF9EID17>
extern volatile __bit                   RXF9EID17           __at(0x6B89);	// @ (0xD71 * 8 + 1)
#define                                 RXF9EID17_bit       _BIT_ACCESS(RXF9SIDL,1)
// RXF9EIDL<RXF9EID2>
extern volatile __bit                   RXF9EID2            __at(0x6B9A);	// @ (0xD73 * 8 + 2)
#define                                 RXF9EID2_bit        _BIT_ACCESS(RXF9EIDL,2)
// RXF9EIDL<RXF9EID3>
extern volatile __bit                   RXF9EID3            __at(0x6B9B);	// @ (0xD73 * 8 + 3)
#define                                 RXF9EID3_bit        _BIT_ACCESS(RXF9EIDL,3)
// RXF9EIDL<RXF9EID4>
extern volatile __bit                   RXF9EID4            __at(0x6B9C);	// @ (0xD73 * 8 + 4)
#define                                 RXF9EID4_bit        _BIT_ACCESS(RXF9EIDL,4)
// RXF9EIDL<RXF9EID5>
extern volatile __bit                   RXF9EID5            __at(0x6B9D);	// @ (0xD73 * 8 + 5)
#define                                 RXF9EID5_bit        _BIT_ACCESS(RXF9EIDL,5)
// RXF9EIDL<RXF9EID6>
extern volatile __bit                   RXF9EID6            __at(0x6B9E);	// @ (0xD73 * 8 + 6)
#define                                 RXF9EID6_bit        _BIT_ACCESS(RXF9EIDL,6)
// RXF9EIDL<RXF9EID7>
extern volatile __bit                   RXF9EID7            __at(0x6B9F);	// @ (0xD73 * 8 + 7)
#define                                 RXF9EID7_bit        _BIT_ACCESS(RXF9EIDL,7)
// RXF9EIDH<RXF9EID8>
extern volatile __bit                   RXF9EID8            __at(0x6B90);	// @ (0xD72 * 8 + 0)
#define                                 RXF9EID8_bit        _BIT_ACCESS(RXF9EIDH,0)
// RXF9EIDH<RXF9EID9>
extern volatile __bit                   RXF9EID9            __at(0x6B91);	// @ (0xD72 * 8 + 1)
#define                                 RXF9EID9_bit        _BIT_ACCESS(RXF9EIDH,1)
// RXFCON1<RXF9EN>
extern volatile __bit                   RXF9EN              __at(0x6EA9);	// @ (0xDD5 * 8 + 1)
#define                                 RXF9EN_bit          _BIT_ACCESS(RXFCON1,1)
// RXF9SIDL<RXF9EXIDEN>
extern volatile __bit                   RXF9EXIDEN          __at(0x6B8B);	// @ (0xD71 * 8 + 3)
#define                                 RXF9EXIDEN_bit      _BIT_ACCESS(RXF9SIDL,3)
// RXF9SIDL<RXF9SID0>
extern volatile __bit                   RXF9SID0            __at(0x6B8D);	// @ (0xD71 * 8 + 5)
#define                                 RXF9SID0_bit        _BIT_ACCESS(RXF9SIDL,5)
// RXF9SIDL<RXF9SID1>
extern volatile __bit                   RXF9SID1            __at(0x6B8E);	// @ (0xD71 * 8 + 6)
#define                                 RXF9SID1_bit        _BIT_ACCESS(RXF9SIDL,6)
// RXF9SIDH<RXF9SID10>
extern volatile __bit                   RXF9SID10           __at(0x6B87);	// @ (0xD70 * 8 + 7)
#define                                 RXF9SID10_bit       _BIT_ACCESS(RXF9SIDH,7)
// RXF9SIDL<RXF9SID2>
extern volatile __bit                   RXF9SID2            __at(0x6B8F);	// @ (0xD71 * 8 + 7)
#define                                 RXF9SID2_bit        _BIT_ACCESS(RXF9SIDL,7)
// RXF9SIDH<RXF9SID3>
extern volatile __bit                   RXF9SID3            __at(0x6B80);	// @ (0xD70 * 8 + 0)
#define                                 RXF9SID3_bit        _BIT_ACCESS(RXF9SIDH,0)
// RXF9SIDH<RXF9SID4>
extern volatile __bit                   RXF9SID4            __at(0x6B81);	// @ (0xD70 * 8 + 1)
#define                                 RXF9SID4_bit        _BIT_ACCESS(RXF9SIDH,1)
// RXF9SIDH<RXF9SID5>
extern volatile __bit                   RXF9SID5            __at(0x6B82);	// @ (0xD70 * 8 + 2)
#define                                 RXF9SID5_bit        _BIT_ACCESS(RXF9SIDH,2)
// RXF9SIDH<RXF9SID6>
extern volatile __bit                   RXF9SID6            __at(0x6B83);	// @ (0xD70 * 8 + 3)
#define                                 RXF9SID6_bit        _BIT_ACCESS(RXF9SIDH,3)
// RXF9SIDH<RXF9SID7>
extern volatile __bit                   RXF9SID7            __at(0x6B84);	// @ (0xD70 * 8 + 4)
#define                                 RXF9SID7_bit        _BIT_ACCESS(RXF9SIDH,4)
// RXF9SIDH<RXF9SID8>
extern volatile __bit                   RXF9SID8            __at(0x6B85);	// @ (0xD70 * 8 + 5)
#define                                 RXF9SID8_bit        _BIT_ACCESS(RXF9SIDH,5)
// RXF9SIDH<RXF9SID9>
extern volatile __bit                   RXF9SID9            __at(0x6B86);	// @ (0xD70 * 8 + 6)
#define                                 RXF9SID9_bit        _BIT_ACCESS(RXF9SIDH,6)
// RXM0EIDL<RXM0EID0>
extern volatile __bit                   RXM0EID0            __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 RXM0EID0_bit        _BIT_ACCESS(RXM0EIDL,0)
// RXM0EIDL<RXM0EID1>
extern volatile __bit                   RXM0EID1            __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 RXM0EID1_bit        _BIT_ACCESS(RXM0EIDL,1)
// RXM0EIDH<RXM0EID10>
extern volatile __bit                   RXM0EID10           __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 RXM0EID10_bit       _BIT_ACCESS(RXM0EIDH,2)
// RXM0EIDH<RXM0EID11>
extern volatile __bit                   RXM0EID11           __at(0x78D3);	// @ (0xF1A * 8 + 3)
#define                                 RXM0EID11_bit       _BIT_ACCESS(RXM0EIDH,3)
// RXM0EIDH<RXM0EID12>
extern volatile __bit                   RXM0EID12           __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 RXM0EID12_bit       _BIT_ACCESS(RXM0EIDH,4)
// RXM0EIDH<RXM0EID13>
extern volatile __bit                   RXM0EID13           __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 RXM0EID13_bit       _BIT_ACCESS(RXM0EIDH,5)
// RXM0EIDH<RXM0EID14>
extern volatile __bit                   RXM0EID14           __at(0x78D6);	// @ (0xF1A * 8 + 6)
#define                                 RXM0EID14_bit       _BIT_ACCESS(RXM0EIDH,6)
// RXM0EIDH<RXM0EID15>
extern volatile __bit                   RXM0EID15           __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 RXM0EID15_bit       _BIT_ACCESS(RXM0EIDH,7)
// RXM0SIDL<RXM0EID16>
extern volatile __bit                   RXM0EID16           __at(0x78C8);	// @ (0xF19 * 8 + 0)
#define                                 RXM0EID16_bit       _BIT_ACCESS(RXM0SIDL,0)
// RXM0SIDL<RXM0EID17>
extern volatile __bit                   RXM0EID17           __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 RXM0EID17_bit       _BIT_ACCESS(RXM0SIDL,1)
// RXM0EIDL<RXM0EID2>
extern volatile __bit                   RXM0EID2            __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 RXM0EID2_bit        _BIT_ACCESS(RXM0EIDL,2)
// RXM0EIDL<RXM0EID3>
extern volatile __bit                   RXM0EID3            __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 RXM0EID3_bit        _BIT_ACCESS(RXM0EIDL,3)
// RXM0EIDL<RXM0EID4>
extern volatile __bit                   RXM0EID4            __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 RXM0EID4_bit        _BIT_ACCESS(RXM0EIDL,4)
// RXM0EIDL<RXM0EID5>
extern volatile __bit                   RXM0EID5            __at(0x78DD);	// @ (0xF1B * 8 + 5)
#define                                 RXM0EID5_bit        _BIT_ACCESS(RXM0EIDL,5)
// RXM0EIDL<RXM0EID6>
extern volatile __bit                   RXM0EID6            __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 RXM0EID6_bit        _BIT_ACCESS(RXM0EIDL,6)
// RXM0EIDL<RXM0EID7>
extern volatile __bit                   RXM0EID7            __at(0x78DF);	// @ (0xF1B * 8 + 7)
#define                                 RXM0EID7_bit        _BIT_ACCESS(RXM0EIDL,7)
// RXM0EIDH<RXM0EID8>
extern volatile __bit                   RXM0EID8            __at(0x78D0);	// @ (0xF1A * 8 + 0)
#define                                 RXM0EID8_bit        _BIT_ACCESS(RXM0EIDH,0)
// RXM0EIDH<RXM0EID9>
extern volatile __bit                   RXM0EID9            __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 RXM0EID9_bit        _BIT_ACCESS(RXM0EIDH,1)
// RXM0SIDL<RXM0EXIDM>
extern volatile __bit                   RXM0EXIDM           __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 RXM0EXIDM_bit       _BIT_ACCESS(RXM0SIDL,3)
// RXM0SIDL<RXM0SID0>
extern volatile __bit                   RXM0SID0            __at(0x78CD);	// @ (0xF19 * 8 + 5)
#define                                 RXM0SID0_bit        _BIT_ACCESS(RXM0SIDL,5)
// RXM0SIDL<RXM0SID1>
extern volatile __bit                   RXM0SID1            __at(0x78CE);	// @ (0xF19 * 8 + 6)
#define                                 RXM0SID1_bit        _BIT_ACCESS(RXM0SIDL,6)
// RXM0SIDH<RXM0SID10>
extern volatile __bit                   RXM0SID10           __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 RXM0SID10_bit       _BIT_ACCESS(RXM0SIDH,7)
// RXM0SIDL<RXM0SID2>
extern volatile __bit                   RXM0SID2            __at(0x78CF);	// @ (0xF19 * 8 + 7)
#define                                 RXM0SID2_bit        _BIT_ACCESS(RXM0SIDL,7)
// RXM0SIDH<RXM0SID3>
extern volatile __bit                   RXM0SID3            __at(0x78C0);	// @ (0xF18 * 8 + 0)
#define                                 RXM0SID3_bit        _BIT_ACCESS(RXM0SIDH,0)
// RXM0SIDH<RXM0SID4>
extern volatile __bit                   RXM0SID4            __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 RXM0SID4_bit        _BIT_ACCESS(RXM0SIDH,1)
// RXM0SIDH<RXM0SID5>
extern volatile __bit                   RXM0SID5            __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 RXM0SID5_bit        _BIT_ACCESS(RXM0SIDH,2)
// RXM0SIDH<RXM0SID6>
extern volatile __bit                   RXM0SID6            __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 RXM0SID6_bit        _BIT_ACCESS(RXM0SIDH,3)
// RXM0SIDH<RXM0SID7>
extern volatile __bit                   RXM0SID7            __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 RXM0SID7_bit        _BIT_ACCESS(RXM0SIDH,4)
// RXM0SIDH<RXM0SID8>
extern volatile __bit                   RXM0SID8            __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 RXM0SID8_bit        _BIT_ACCESS(RXM0SIDH,5)
// RXM0SIDH<RXM0SID9>
extern volatile __bit                   RXM0SID9            __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 RXM0SID9_bit        _BIT_ACCESS(RXM0SIDH,6)
// RXM1EIDL<RXM1EID0>
extern volatile __bit                   RXM1EID0            __at(0x78F8);	// @ (0xF1F * 8 + 0)
#define                                 RXM1EID0_bit        _BIT_ACCESS(RXM1EIDL,0)
// RXM1EIDL<RXM1EID1>
extern volatile __bit                   RXM1EID1            __at(0x78F9);	// @ (0xF1F * 8 + 1)
#define                                 RXM1EID1_bit        _BIT_ACCESS(RXM1EIDL,1)
// RXM1EIDH<RXM1EID10>
extern volatile __bit                   RXM1EID10           __at(0x78F2);	// @ (0xF1E * 8 + 2)
#define                                 RXM1EID10_bit       _BIT_ACCESS(RXM1EIDH,2)
// RXM1EIDH<RXM1EID11>
extern volatile __bit                   RXM1EID11           __at(0x78F3);	// @ (0xF1E * 8 + 3)
#define                                 RXM1EID11_bit       _BIT_ACCESS(RXM1EIDH,3)
// RXM1EIDH<RXM1EID12>
extern volatile __bit                   RXM1EID12           __at(0x78F4);	// @ (0xF1E * 8 + 4)
#define                                 RXM1EID12_bit       _BIT_ACCESS(RXM1EIDH,4)
// RXM1EIDH<RXM1EID13>
extern volatile __bit                   RXM1EID13           __at(0x78F5);	// @ (0xF1E * 8 + 5)
#define                                 RXM1EID13_bit       _BIT_ACCESS(RXM1EIDH,5)
// RXM1EIDH<RXM1EID14>
extern volatile __bit                   RXM1EID14           __at(0x78F6);	// @ (0xF1E * 8 + 6)
#define                                 RXM1EID14_bit       _BIT_ACCESS(RXM1EIDH,6)
// RXM1EIDH<RXM1EID15>
extern volatile __bit                   RXM1EID15           __at(0x78F7);	// @ (0xF1E * 8 + 7)
#define                                 RXM1EID15_bit       _BIT_ACCESS(RXM1EIDH,7)
// RXM1SIDL<RXM1EID16>
extern volatile __bit                   RXM1EID16           __at(0x78E8);	// @ (0xF1D * 8 + 0)
#define                                 RXM1EID16_bit       _BIT_ACCESS(RXM1SIDL,0)
// RXM1SIDL<RXM1EID17>
extern volatile __bit                   RXM1EID17           __at(0x78E9);	// @ (0xF1D * 8 + 1)
#define                                 RXM1EID17_bit       _BIT_ACCESS(RXM1SIDL,1)
// RXM1EIDL<RXM1EID2>
extern volatile __bit                   RXM1EID2            __at(0x78FA);	// @ (0xF1F * 8 + 2)
#define                                 RXM1EID2_bit        _BIT_ACCESS(RXM1EIDL,2)
// RXM1EIDL<RXM1EID3>
extern volatile __bit                   RXM1EID3            __at(0x78FB);	// @ (0xF1F * 8 + 3)
#define                                 RXM1EID3_bit        _BIT_ACCESS(RXM1EIDL,3)
// RXM1EIDL<RXM1EID4>
extern volatile __bit                   RXM1EID4            __at(0x78FC);	// @ (0xF1F * 8 + 4)
#define                                 RXM1EID4_bit        _BIT_ACCESS(RXM1EIDL,4)
// RXM1EIDL<RXM1EID5>
extern volatile __bit                   RXM1EID5            __at(0x78FD);	// @ (0xF1F * 8 + 5)
#define                                 RXM1EID5_bit        _BIT_ACCESS(RXM1EIDL,5)
// RXM1EIDL<RXM1EID6>
extern volatile __bit                   RXM1EID6            __at(0x78FE);	// @ (0xF1F * 8 + 6)
#define                                 RXM1EID6_bit        _BIT_ACCESS(RXM1EIDL,6)
// RXM1EIDL<RXM1EID7>
extern volatile __bit                   RXM1EID7            __at(0x78FF);	// @ (0xF1F * 8 + 7)
